app/controllers/rooms_controller.rb

  def create

    @room = Room.new(params.require(:room).permit(:name,:introduction,:price,:adress,:avatar))
    binding.pry
    if @room.save!
---
INSERT INTO "rooms" ("name", "introduction", "price", "adress", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "あ"], ["introduction", "あ"], ["price", 333], ["adress", "山梨"], ["created_at", "2022-04-26 05:45:13.875817"], ["updated_at", "2022-04-26 05:45:13.875817"]]

  def destroy
    @room = Room.find(params[:id])
    @room.destroy
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 30]]