app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users"."id" FROM "users"

  def update
    @user = User.find(params[:id])
    binding.pry
    if @user.update!(params.require(:user).permit(:icon,:introduction,:password))
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 33], ["LIMIT", 1]]
UPDATE "users" SET "encrypted_password" = ?, "updated_at" = ?, "icon" = ? WHERE "users"."id" = ?  [["encrypted_password", "$2a$12$Sb5rcIBJGpLGFHqovmsaVu/bOdWEA9Ilara.UDX7xENEeAuBbdrOu"], ["updated_at", "2022-05-17 03:03:22.059095"], ["icon", "スクリーンショット_2022-05-17_11.24.45.png"], ["id", 34]]

  def image_for
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 29], ["LIMIT", 1]]